BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega32M1.PIC
        <edc:AdjustPoint edc:_addr="0x93" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x94" edc:access="nnnnnnnn" edc:cname="AC0CON" edc:nzwidth="0x8" ltx:memberofperipheral="AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AC0M" edc:desc="Analog Comparator 0 Multiplexer Register" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ACCKSEL" edc:desc="Analog Comparator Clock Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC0IS" edc:desc="Analog Comparator 0  Interrupt Select Bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="AC0IE" edc:desc="Analog Comparator 0 Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC0EN" edc:desc="Analog Comparator 0 Enable Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x95" edc:access="nnnnnnnn" edc:cname="AC1CON" edc:nzwidth="0x8" ltx:memberofperipheral="AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AC1M" edc:desc="Analog Comparator 1 Multiplexer Register" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="AC1ICE" edc:desc="Analog Comparator 1 Interrupt Capture Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC1IS" edc:desc="Analog Comparator 1  Interrupt Select Bit" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Interrupt on Toggle" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Interrupt on Falling Edge" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Interrupt on Rising Edge" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="AC1IE" edc:desc="Analog Comparator 1 Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC1EN" edc:desc="Analog Comparator 1 Enable Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x96" edc:access="nnnn-nnn" edc:cname="AC2CON" edc:nzwidth="0x8" ltx:memberofperipheral="AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AC2M" edc:desc="Analog Comparator 2 Multiplexer Register" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AC2IS" edc:desc="Analog Comparator 2  Interrupt Select Bit" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Interrupt on Toggle" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Interrupt on Falling Edge" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Interrupt on Rising Edge" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="AC2IE" edc:desc="Analog Comparator 2 Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC2EN" edc:desc="Analog Comparator 2 Enable Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x97" edc:access="nnnn-nnn" edc:cname="AC3CON" edc:nzwidth="0x8" ltx:memberofperipheral="AC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="AC3M" edc:desc="Analog Comparator 3 Multiplexer Register" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="AC3IS" edc:desc="Analog Comparator 3  Interrupt Select Bit" edc:nzwidth="0x2">
                <edc:SFRFieldSemantic edc:cname="VAL_0x00" edc:desc="Interrupt on Toggle" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x01" edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x02" edc:desc="Interrupt on Falling Edge" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="VAL_0x03" edc:desc="Interrupt on Rising Edge" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="AC3IE" edc:desc="Analog Comparator 3 Interrupt Enable Bit" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC3EN" edc:desc="Analog Comparator 3 Enable Bit" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x98" edc:offset="0x8"/>
        <edc:SFRDef edc:_addr="0xA0" edc:access="nnnnnnnnnnnnnnnn" edc:cname="POCR0SA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC"/>
        <edc:SFRDef edc:_addr="0xA2" edc:access="nnnnnnnnnnnnnnnn" edc:cname="POCR0RA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC"/>
        <edc:SFRDef edc:_addr="0xA4" edc:access="nnnnnnnnnnnnnnnn" edc:cname="POCR0SB" edc:nzwidth="0x10" ltx:memberofperipheral="PSC"/>
        <edc:SFRDef edc:_addr="0xA6" edc:access="nnnnnnnnnnnnnnnn" edc:cname="POCR1SA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC"/>
        <edc:SFRDef edc:_addr="0xA8" edc:access="nnnnnnnnnnnnnnnn" edc:cname="POCR1RA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC"/>
        <edc:SFRDef edc:_addr="0xAA" edc:access="nnnnnnnnnnnnnnnn" edc:cname="POCR1SB" edc:nzwidth="0x10" ltx:memberofperipheral="PSC"/>
        <edc:SFRDef edc:_addr="0xAC" edc:access="nnnnnnnnnnnnnnnn" edc:cname="POCR2SA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC"/>
        <edc:SFRDef edc:_addr="0xAE" edc:access="nnnnnnnnnnnnnnnn" edc:cname="POCR2RA" edc:nzwidth="0x10" ltx:memberofperipheral="PSC"/>
        <edc:SFRDef edc:_addr="0xB0" edc:access="nnnnnnnnnnnnnnnn" edc:cname="POCR2SB" edc:nzwidth="0x10" ltx:memberofperipheral="PSC"/>
        <edc:SFRDef edc:_addr="0xB2" edc:access="nnnnnnnnnnnnnnnn" edc:cname="POCR_RB" edc:nzwidth="0x10" ltx:memberofperipheral="PSC"/>
        <edc:SFRDef edc:_addr="0xB4" edc:access="--nnnnnn" edc:cname="PSYNC" edc:nzwidth="0x8" ltx:memberofperipheral="PSC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSYNC0" edc:desc="Selection of Synchronization Out for ADC" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PSYNC1" edc:desc="Selection of Synchronization Out for ADC" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="PSYNC2" edc:desc="Selection of Synchronization Out for ADC" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB5" edc:access="--nnnn--" edc:cname="PCNF" edc:nzwidth="0x8" ltx:memberofperipheral="PSC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="POPA" edc:desc="PSC Output A Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POPB" edc:desc="PSC Output B Polarity" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMODE" edc:desc="PSC Mode" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PULOCK" edc:desc="PSC Update Lock" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
