BsAtHome/atpack/Atmel.ATmega_DFP.atpack/edc/ATmega32M1.PIC
        <edc:SFRDef edc:_addr="0xB6" edc:access="--nnnnnn" edc:cname="POC" edc:nzwidth="0x8" ltx:memberofperipheral="PSC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POEN0A" edc:desc="PSC Output 0A Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN0B" edc:desc="PSC Output 0B Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN1A" edc:desc="PSC Output 1A Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN1B" edc:desc="PSC Output 1B Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN2A" edc:desc="PSC Output 2A Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POEN2B" edc:desc="PSC Output 2B Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB7" edc:access="nnn---nn" edc:cname="PCTL" edc:nzwidth="0x8" ltx:memberofperipheral="PSC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRUN" edc:desc="PSC Run" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCCYC" edc:desc="PSC Complete Cycle" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="PCLKSEL" edc:desc="PSC Input Clock Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PPRE" edc:desc="PSC Prescaler Select bits" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB8" edc:access="nnnnnnnn" edc:cname="PMIC0" edc:nzwidth="0x8" ltx:memberofperipheral="PSC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM0" edc:desc="PSC Module 0 Input Mode bits" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PAOC0" edc:desc="PSC Module 0 Asynchronous Output Control" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PFLTE0" edc:desc="PSC Module 0 Input Filter Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV0" edc:desc="PSC Module 0 Input Level Selector" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL0" edc:desc="PSC Module 0 Input Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVEN0" edc:desc="PSC Module 0 Overlap Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xB9" edc:access="nnnnnnnn" edc:cname="PMIC1" edc:nzwidth="0x8" ltx:memberofperipheral="PSC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM1" edc:desc="PSC Module 1 Input Mode bits" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PAOC1" edc:desc="PSC Module 1 Asynchronous Output Control" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PFLTE1" edc:desc="PSC Module 1 Input Filter Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV1" edc:desc="PSC Module 1 Input Level Selector" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL1" edc:desc="PSC Module 1 Input Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVEN1" edc:desc="PSC Module 1 Overlap Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xBA" edc:access="nnnnnnnn" edc:cname="PMIC2" edc:nzwidth="0x8" ltx:memberofperipheral="PSC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRFM2" edc:desc="PSC Module 2 Input Mode bits" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PAOC2" edc:desc="PSC Module 2 Asynchronous Output Control" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PFLTE2" edc:desc="PSC Module 2 Input Filter Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PELEV2" edc:desc="PSC Module 2 Input Level Selector" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PISEL2" edc:desc="PSC Module 2 Input Select" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POVEN2" edc:desc="PSC Module 2 Overlap Enable" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xBB" edc:access="----nnnn" edc:cname="PIM" edc:nzwidth="0x8" ltx:memberofperipheral="PSC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PEOPE" edc:desc="PSC End of Cycle Interrupt Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEVE" edc:desc="External Event 2 Interrupt Enable" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xBC" edc:access="----nnnn" edc:cname="PIFR" edc:nzwidth="0x8" ltx:memberofperipheral="PSC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PEOP" edc:desc="PSC End of Cycle Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PEV" edc:desc="PSC External Event 2 Interrupt" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0xBD" edc:offset="0xB"/>
        <edc:SFRDef edc:_addr="0xC8" edc:access="nnnnnnnn" edc:cname="LINCR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCMD" edc:desc="LIN Command and Mode bits" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="LENA" edc:desc="LIN or UART Enable" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LCONF" edc:desc="LIN Configuration bits" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="LIN13" edc:desc="LIN Standard" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LSWRES" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0xC9" edc:access="nnnnnnnn" edc:cname="LINSIR" edc:nzwidth="0x8" ltx:memberofperipheral="LINUART">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LRXOK" edc:desc="Receive Performed Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LTXOK" edc:desc="Transmit Performed Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LIDOK" edc:desc="Identifier Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LERR" edc:desc="Error Interrupt" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LBUSY" edc:desc="Busy Signal" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LIDST" edc:desc="Identifier Status bits" edc:nzwidth="0x3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
